{
    "displayName": "Guest 2 - Require MFA from critical Guests",
    "state": "enabledForReportingButNotEnforced",
    "conditions": {
        "signInRiskLevels": [],
        "clientAppTypes": [
            "mobileAppsAndDesktopClients",
            "browser"
        ],
        "platforms": {
            "includePlatforms": [
                "All"
            ],
            "excludePlatforms": [
            ]
        },
        "applications": {
            "includeApplications": [
                "All"
            ]
        },
        "users": {
            "includeGroups": [
                "bed30a62-40fe-4ab0-a4b1-76021e6734c7"
            ],
            "excludeGroups": []
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "mfa"
        ]
    }
}