{
    "displayName": "Legacy 2 - Block legacy auth",
    "state": "enabledForReportingButNotEnforced",
    "conditions": {
        "signInRiskLevels": [],
        "userRiskLevels": [],
        "clientAppTypes": [
            "exchangeActiveSync",
            "other"
        ],
        "locations": {
            "includeLocations": [
                "All"
            ],
            "excludeLocations": [
                "AllTrusted"
            ]
        },
        "applications": {
            "includeApplications": [
                "All"
            ]
        },
        "users": {
            "includeUsers": [
                "All"
            ],
            "excludeUsers": [],
            "includeGroups": [
            ],
            "excludeGroups": []
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "block"
        ]
    }
}