{
    "displayName": "Guest 3 - Require MFA from critical Guests",
    "state": "disabled",
    "conditions": {
        "signInRiskLevels": [],
        "clientAppTypes": [
            "browser"
        ],
        "platforms": {
            "includePlatforms": [
                "All"
            ],
            "excludePlatforms": [
            ]
        },
        "applications": {
            "includeApplications": [
                "All"
            ]
        },
        "users": {
            "includeGroups": [
                "6c96716b-b32b-40b8-9009-49748bb6fcd5"
            ],
            "excludeGroups": []
        },
        "devices": {
            "includeDeviceStates": [],
            "excludeDeviceStates": [],
            "includeDevices": [
                "All"
            ],
            "excludeDevices": [],
            "deviceFilter": null
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "mfa"
        ]
    }
}