{
    "displayName": "Workplace 4 - Require MFA",
    "state": "disabled",
    "conditions": {
        "signInRiskLevels": [],
        "userRiskLevels": [],
        "clientAppTypes": [
            "browser",
            "mobileAppsAndDesktopClients"
        ],
        "platforms": {
            "includePlatforms": [
                "All"
            ],
            "excludePlatforms": [
                "iOS",
                "android"
            ]
        },
        "applications": {
            "includeApplications": [
                "All"
            ]
        },
        "users": {
            "includeGroups": [
                "6c96716b-b32b-40b8-9009-49748bb6fcd5"
            ],
            "excludeGroups": []
        },
        "devices": {
            "includeDeviceStates": [],
            "excludeDeviceStates": [],
            "includeDevices": [
                "All"
            ],
            "excludeDevices": [
                "Compliant"
            ],
            "deviceFilter": null
        }
    },
    "grantControls": {
        "operator": "AND",
        "builtInControls": [
            "compliantDevice",
            "mfa"
        ]
    }
}