{
    "displayName": "Admin 1 - Require compliant device",
    "state": "enabled",
    "sessionControls": null,
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "browser",
            "mobileAppsAndDesktopClients"
        ],
        "servicePrincipalRiskLevels": [],
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [
                "a4a365df-50f1-4397-bc59-1a1564b8bb9c",
                "9cdead84-a844-4324-93f2-b2e6bb768d07",
                "d4ebce55-015a-49b5-a083-c84d1797ae8c"
            ],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": []
        },
        "users": {
            "includeUsers": [],
            "excludeUsers": [
                "f974c6fd-78b5-462f-8c22-20088cf70dec",
                "dafe857a-f92e-4763-a785-e01520c5f6e3",
                "45493151-3540-4d48-b311-6b98ec68f9b4",
                "8145ad6d-5372-4626-ad12-186b9ce0a163",
                "2300ccc8-2124-4937-84f0-3a63872af609",
                "58941a10-492a-46c2-b6c3-b215e0306e31"
            ],
            "includeGroups": [
                "efcbff71-7ea4-4134-9063-dad950548ef1"
            ],
            "excludeGroups": [
                "a0553820-cc4a-4256-9992-42a153ca4413",
                "0216fb01-188f-4676-8079-af5ac19418af"
            ],
            "includeRoles": [
                "62e90394-69f5-4237-9190-012177145e10",
                "194ae4cb-b126-40b2-bd5b-6091b380977d",
                "75941009-915a-4869-abe7-691bff18279e"
            ],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        },
        "platforms": {
            "includePlatforms": [
                "all"
            ],
            "excludePlatforms": [
                "android",
                "iOS",
                "macOS",
                "linux"
            ]
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "compliantDevice",
            "domainJoinedDevice"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": []
    }
}