{ 
    "displayName": "Mobile 1 - Require approved client apps for Office 365 except EXO", 
    "state": "enabled", 
    "conditions": { 
        "signInRiskLevels": [],
        "userRiskLevels": [],
        "clientAppTypes": [
            "mobileAppsAndDesktopClients",
            "browser"
        ],
        "platforms": {
            "includePlatforms": [
                "iOS",
                "android"
            ],
            "excludePlatforms": []
        },
        "applications": { 
            "includeApplications": [ 
                "Office365"
            ],
            "excludeApplications": [
                "00000002-0000-0ff1-ce00-000000000000"
            ]
        }, 
        "users": { 
            "includeUsers": [
                "All"
            ],
            "excludeUsers": [
                "GuestsOrExternalUsers"
            ],
            "includeGroups": [
            ], 
            "excludeGroups": [ 
                "307c4c83-25ac-4bd6-8552-a07d1a6d6e9d"
            ] 
        }
    }, 
    "grantControls": { 
        "operator": "OR", 
        "builtInControls": [ 
             "approvedApplication"
        ] 
    } 
}